<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
<!DOCTYPE html>
<html>
    <body>
        <h2>Assignment 4</h2>
        <h4>Розробити веб-застосунок з функцією автентифікації.<br>
            Повинна бути сторінка, на якій користувач вводить логін і пароль, та кнопка "Login"..<br>
            Якщо користувач не вводить хоча б одне з цих полів або вони неправильні, користувачу відображається та сама сторінка з повідомленням про помилку..<br>
            Якщо користувач вводить логін-пароль вірно, то він потрапляє на сторінку привітання..<br>
            На сторінці привітання відображається системне меню, в якому є 2 пункти - перехід на сторінку зі списком користувачів і "Logout"..<br>
            На сторінці зі списком користувачів відображаються в статичному вигляді всі наявні в системі користувачі у вигляді таблиці (їх логіни і імена, але без паролів)..<br>
            Сторінка привітання і сторінка зі списком користувачів повинні бути доступні лише "залогіненим" користувачам (побачити їх, не ввівши правильній логін-пароль, повинно бути неможливо).<br>
            При виборі "Logout" користувач потрапляє на сторінку входу і повинен вводити логін-пароль заново.</h4>
        <hr>
        <h2>KEY ENDPOINTS:</h2><br>
        <h4><a href="/auth/registration">(POST) localhost:8080/auth/registration</a></h4> - show registration page
        <h4><a href="/auth">(GET) localhost:8080/auth</a></h4> - show login page
        <h4><a href="/main">(GET) localhost:8080/main</a></h4> - main page (for authenticated only)
    </body>
</html>
